#+TITLE: Unix for OSX
* Unixを使う理由
** Unixの威力
以下のコマンドは，実行中のプロセスの一覧を表示する．
ヘッダの意味は，以下．
- PID: プロセスを識別する番号
- <<TTY>>: そのプロセスが実行されているターミナルの名前．??となっていたら，GUIではなくターミナルで動いていることを意味する．名前の最後にdがついているものはデーモン．
- TIME: そのプロセスが実行され続けている時間．
- CMD: 実行されているプロセスの完全なパス名．
#+BEGIN_SRC sh
ps -acx
#+END_SRC

#+RESULTS:
|   PID | TTY     |      TIME | CMD                                           |          |              |
|     1 | ??      |  37:59.45 | launchd                                       |          |              |
|    61 | ??      |   0:54.36 | syslogd                                       |          |              |
|    62 | ??      |   0:21.71 | UserEventAgent                                |          |              |
|    66 | ??      |   0:18.39 | uninstalld                                    |          |              |
|    67 | ??      |   1:55.58 | kextd                                         |          |              |
|    68 | ??      |   4:29.72 | fseventsd                                     |          |              |
|    70 | ??      |   0:08.71 | mediaremoted                                  |          |              |
|    73 | ??      |   0:04.78 | appleeventsd                                  |          |              |
|    74 | ??      |  16:38.29 | systemstats                                   |          |              |
|    76 | ??      |   3:11.90 | configd                                       |          |              |
|    77 | ??      |   4:21.43 | powerd                                        |          |              |
|    80 | ??      |   8:20.08 | logd                                          |          |              |
|    81 | ??      |   0:00.02 | keybagd                                       |          |              |
|    87 | ??      |  10:33.22 | mds                                           |          |              |
|    88 | ??      |   0:00.84 | iconservicesd                                 |          |              |
|    89 | ??      |   0:18.42 | diskarbitrationd                              |          |              |
|    92 | ??      |   0:13.98 | backupd-helper                                |          |              |
|    93 | ??      |   2:14.18 | coreduetd                                     |          |              |
|    97 | ??      |   4:37.95 | opendirectoryd                                |          |              |
|    98 | ??      |   1:12.30 | apsd                                          |          |              |
|    99 | ??      |   0:01.47 | nbstated                                      |          |              |
|   100 | ??      |   3:40.86 | launchservicesd                               |          |              |
|   101 | ??      |   0:12.52 | timed                                         |          |              |
|   102 | ??      |   1:25.04 | securityd                                     |          |              |
|   103 | ??      |   8:25.29 | usbmuxd                                       |          |              |
|   105 | ??      |   9:16.98 | locationd                                     |          |              |
|   107 | ??      |   0:00.07 | autofsd                                       |          |              |
|   108 | ??      |   0:02.97 | displaypolicyd                                |          |              |
|   109 | ??      |   1:39.16 | dasd                                          |          |              |
|   110 | ??      |   0:01.55 | kdc                                           |          |              |
|   114 | ??      |   4:28.98 | loginwindow                                   |          |              |
|   115 | ??      |   0:00.70 | logind                                        |          |              |
|   116 | ??      |   0:02.51 | revisiond                                     |          |              |
|   117 | ??      |   0:00.07 | KernelEventAgent                              |          |              |
|   119 | ??      |   6:13.51 | bluetoothd                                    |          |              |
|   120 | ??      |  40:58.40 | hidd                                          |          |              |
|   122 | ??      |   2:36.48 | corebrightnessd                               |          |              |
|   123 | ??      |   0:14.53 | AirPlayXPCHelper                              |          |              |
|   124 | ??      |   3:24.50 | notifyd                                       |          |              |
|   125 | ??      |   0:08.21 | distnoted                                     |          |              |
|   126 | ??      |   1:02.18 | cfprefsd                                      |          |              |
|   127 | ??      |   1:05.42 | coreservicesd                                 |          |              |
|   128 | ??      |   0:14.05 | amfid                                         |          |              |
|   130 | ??      |   0:13.68 | authd                                         |          |              |
|   131 | ??      |   0:01.19 | aslmanager                                    |          |              |
|   145 | ??      |   2:17.82 | contextstored                                 |          |              |
|   151 | ??      |  15:03.11 | coreaudiod                                    |          |              |
|   153 | ??      |   0:02.81 | nehelper                                      |          |              |
|   160 | ??      |   3:18.97 | trustd                                        |          |              |
|   162 | ??      |   0:00.02 | com.apple.ctkpcscd                            |          |              |
|   164 | ??      |   0:00.04 | ctkd                                          |          |              |
|   168 | ??      |   0:01.46 | com.apple.audio.DriverHelper                  |          |              |
|   169 | ??      |   3:38.42 | symptomsd                                     |          |              |
|   178 | ??      |   0:53.38 | mobileassetd                                  |          |              |
|   188 | ??      |   0:17.62 | nsurlsessiond                                 |          |              |
|   189 | ??      |   3:36.74 | mDNSResponder                                 |          |              |
|   191 | ??      |   0:15.27 | lsd                                           |          |              |
|   192 | ??      |   0:25.67 | mDNSResponderHelper                           |          |              |
|   214 | ??      |   0:00.06 | ReportCrash                                   |          |              |
|   215 | ??      |   0:06.30 | AssetCacheLocatorService                      |          |              |
|   216 | ??      |   0:00.87 | AssetCache                                    |          |              |
|   218 | ??      |   0:00.52 | com.apple.ifdreader                           |          |              |
|   219 | ??      |   0:00.93 | apfsd                                         |          |              |
|   220 | ??      | 821:10.20 | WindowServer                                  |          |              |
|   221 | ??      |   0:13.80 | usbd                                          |          |              |
|   223 | ??      |   0:08.67 | VDCAssistant                                  |          |              |
|   224 | ??      |   0:00.28 | tzd                                           |          |              |
|   226 | ??      |   1:13.59 | socketfilterfw                                |          |              |
|   231 | ??      |   0:04.90 | nsurlstoraged                                 |          |              |
|   232 | ??      |   3:09.25 | softwareupdated                               |          |              |
|   233 | ??      |   0:01.53 | suhelperd                                     |          |              |
|   234 | ??      |   0:09.44 | rtcreportingd                                 |          |              |
|   237 | ??      |   0:09.65 | coresymbolicationd                            |          |              |
|   239 | ??      |   0:05.32 | watchdogd                                     |          |              |
|   241 | ??      |  35:47.79 | airportd                                      |          |              |
|   245 | ??      |   0:02.74 | thermald                                      |          |              |
|   246 | ??      |   1:02.32 | tccd                                          |          |              |
|   248 | ??      |   0:02.03 | secinitd                                      |          |              |
|   249 | ??      |  13:20.18 | mds_stores                                    |          |              |
|   250 | ??      |   0:00.20 | CVMServer                                     |          |              |
|   251 | ??      |   0:00.42 | colorsync.displayservices                     |          |              |
|   252 | ??      |   0:00.09 | colorsyncd                                    |          |              |
|   259 | ??      |   0:00.44 | AudioComponentRegistrar                       |          |              |
|   260 | ??      |   0:06.31 | MTLCompilerService                            |          |              |
|   262 | ??      |   0:00.02 | com.apple.audio.SandboxHelper                 |          |              |
|   263 | ??      |   0:07.29 | com.apple.CodeSigningHelper                   |          |              |
|   265 | ??      |   0:07.32 | awdd                                          |          |              |
|   267 | ??      |   0:08.99 | iconservicesagent                             |          |              |
|   268 | ??      |   0:00.03 | bootinstalld                                  |          |              |
|   274 | ??      |   0:00.54 | com.apple.AccountPolicyHelper                 |          |              |
|   278 | ??      |   0:01.18 | coreauthd                                     |          |              |
|   279 | ??      |   0:00.59 | securityd_service                             |          |              |
|   280 | ??      |   0:33.56 | com.apple.PerformanceAnalysis.animationperfd  |          |              |
|   281 | ??      |   2:12.43 | cfprefsd                                      |          |              |
|   282 | ??      |   3:05.42 | UserEventAgent                                |          |              |
|   284 | ??      |   4:18.01 | distnoted                                     |          |              |
|   287 | ??      |   1:00.85 | CommCenter                                    |          |              |
|   288 | ??      |   0:38.47 | lsd                                           |          |              |
|   289 | ??      |   7:53.30 | trustd                                        |          |              |
|   290 | ??      |   0:02.59 | captiveagent                                  |          |              |
|   291 | ??      |   0:18.76 | pboard                                        |          |              |
|   292 | ??      |   3:04.99 | secd                                          |          |              |
|   293 | ??      |   0:07.33 | WirelessRadioManagerd                         |          |              |
|   294 | ??      |   2:00.51 | callservicesd                                 |          |              |
|   296 | ??      |   3:10.70 | accountsd                                     |          |              |
|   297 | ??      |   0:50.38 | identityservicesd                             |          |              |
|   299 | ??      |   0:11.61 | imagent                                       |          |              |
|   300 | ??      |   3:17.82 | tccd                                          |          |              |
|   301 | ??      |   0:08.12 | IMDPersistenceAgent                           |          |              |
|   302 | ??      |   0:38.74 | analyticsd                                    |          |              |
|   303 | ??      |   0:08.38 | ContactsAccountsService                       |          |              |
|   304 | ??      |   0:33.97 | secinitd                                      |          |              |
|   305 | ??      |   0:01.94 | languageassetd                                |          |              |
|   306 | ??      |   0:13.23 | homed                                         |          |              |
|   308 | ??      |   1:16.89 | wirelessproxd                                 |          |              |
|   309 | ??      |   0:28.91 | rapportd                                      |          |              |
|   310 | ??      |   0:22.31 | akd                                           |          |              |
|   311 | ??      |   7:29.97 | cloudd                                        |          |              |
|   312 | ??      |   1:47.89 | nsurlsessiond                                 |          |              |
|   313 | ??      |   2:13.61 | routined                                      |          |              |
|   314 | ??      |   0:15.38 | usernoted                                     |          |              |
|   315 | ??      |   0:02.36 | networkserviceproxy                           |          |              |
|   316 | ??      |  11:58.56 | CalendarAgent                                 |          |              |
|   317 | ??      |   0:00.33 | APFSUserAgent                                 |          |              |
|   318 | ??      |   1:51.47 | NotificationCenter                            |          |              |
|   319 | ??      |   0:10.22 | spindump                                      |          |              |
|   320 | ??      |   0:01.36 | SubmitDiagInfo                                |          |              |
|   321 | ??      |   1:36.79 | WiFiAgent                                     |          |              |
|   324 | ??      |   2:05.64 | com.apple.AmbientDisplayAgent                 |          |              |
|   325 | ??      |   0:00.80 | CrashReporterSupportHelper                    |          |              |
|   326 | ??      |   2:44.81 | CalNCService                                  |          |              |
|   327 | ??      |   0:09.73 | IMRemoteURLConnectionAgent                    |          |              |
|   328 | ??      |   1:48.58 | soagent                                       |          |              |
|   329 | ??      |   1:37.00 | useractivityd                                 |          |              |
|   330 | ??      |   2:18.97 | nsurlstoraged                                 |          |              |
|   331 | ??      |   7:29.93 | sharingd                                      |          |              |
|   332 | ??      |   0:03.57 | CloudKeychainProxy                            |          |              |
|   334 | ??      |   0:00.45 | cdpd                                          |          |              |
|   335 | ??      |   0:01.46 | ProtectedCloudKeySyncing                      |          |              |
|   336 | ??      |   0:00.73 | EscrowSecurityAlert                           |          |              |
|   337 | ??      |   0:33.22 | Keychain                                      | Circle   | Notification |
|   338 | ??      |   0:01.12 | mediaremoteagent                              |          |              |
|   339 | ??      |   0:00.57 | familycircled                                 |          |              |
|   340 | ??      |   0:09.25 | fmfd                                          |          |              |
|   341 | ??      |   0:01.86 | IMRemoteURLConnectionAgent                    |          |              |
|   342 | ??      |   0:08.49 | IMRemoteURLConnectionAgent                    |          |              |
|   344 | ??      |   0:00.57 | com.apple.DictionaryServiceHelper             |          |              |
|   345 | ??      |   0:11.98 | adid                                          |          |              |
|   348 | ??      |   0:00.84 | CMFSyncAgent                                  |          |              |
|   350 | ??      |   0:13.45 | sharedfilelistd                               |          |              |
|   351 | ??      |   0:37.58 | CoreLocationAgent                             |          |              |
|   352 | ??      |   1:08.94 | corespotlightd                                |          |              |
|   353 | ??      |   0:12.09 | assistantd                                    |          |              |
|   354 | ??      |   0:01.77 | swcd                                          |          |              |
|   355 | ??      |   0:44.65 | bird                                          |          |              |
|   356 | ??      |   2:11.47 | ViewBridgeAuxiliary                           |          |              |
|   357 | ??      |   0:00.80 | distnoted                                     |          |              |
|   359 | ??      |   0:00.39 | followupd                                     |          |              |
|   360 | ??      |   0:14.98 | systemsoundserverd                            |          |              |
|   361 | ??      |   2:36.42 | iconservicesagent                             |          |              |
|   362 | ??      |   0:08.63 | pbs                                           |          |              |
|   363 | ??      |   0:10.62 | spindump_agent                                |          |              |
|   364 | ??      |   0:14.41 | com.apple.sbd                                 |          |              |
|   365 | ??      |   0:45.23 | talagent                                      |          |              |
|   366 | ??      |   3:38.43 | fontd                                         |          |              |
|   368 | ??      |   0:08.02 | backgroundtaskmanagementagent                 |          |              |
|   369 | ??      |   2:23.09 | ViewBridgeAuxiliary                           |          |              |
|   371 | ??      |   0:34.08 | com.apple.geod                                |          |              |
|   372 | ??      |   3:27.59 | pkd                                           |          |              |
|   373 | ??      |   0:00.99 | storeaccountd                                 |          |              |
|   374 | ??      |   0:00.13 | MTLCompilerService                            |          |              |
|   375 | ??      |   0:23.73 | commerce                                      |          |              |
|   376 | ??      |   0:08.15 | IMRemoteURLConnectionAgent                    |          |              |
|   377 | ??      |   0:00.49 | com.apple.notificationcenterui.WeatherSummary |          |              |
|   379 | ??      |   0:08.79 | AssetCacheLocatorService                      |          |              |
|   381 | ??      |   9:30.70 | sysmond                                       |          |              |
|   384 | ??      |   0:03.75 | systemstats                                   |          |              |
|   387 | ??      |   0:04.37 | com.apple.CloudPhotosConfiguration            |          |              |
|   388 | ??      |  15:23.31 | photolibraryd                                 |          |              |
|   390 | ??      |   0:07.10 | ScopedBookmarkAgent                           |          |              |
|   391 | ??      |   0:04.84 | filecoordinationd                             |          |              |
|   392 | ??      |   0:17.66 | com.apple.photomoments                        |          |              |
|   393 | ??      |   1:42.97 | cloudphotosd                                  |          |              |
|   394 | ??      |  12:27.48 | photoanalysisd                                |          |              |
|   395 | ??      |   0:40.02 | universalAccessAuthWarn                       |          |              |
|   402 | ??      |   0:00.02 | writeconfig                                   |          |              |
|   411 | ??      |   0:04.56 | deleted                                       |          |              |
|   412 | ??      |   0:17.07 | diagnostics_agent                             |          |              |
|   413 | ??      |   0:06.94 | installd                                      |          |              |
|   414 | ??      |   0:00.82 | com.apple.quicklook.ThumbnailsAgent           |          |              |
|   415 | ??      |   0:00.81 | storedownloadd                                |          |              |
|   416 | ??      |   0:02.26 | system_installd                               |          |              |
|   417 | ??      |   0:00.83 | sysdiagnose                                   |          |              |
|   423 | ??      |   0:07.86 | findmydeviced                                 |          |              |
|   425 | ??      |   2:55.13 | SafariBookmarksSyncAgent                      |          |              |
|   426 | ??      |   0:13.03 | passd                                         |          |              |
|   427 | ??      |   0:04.84 | com.apple.MediaLibraryService                 |          |              |
|   430 | ??      |   0:00.64 | softwareupdate_download_service               |          |              |
|   432 | ??      |   0:00.71 | softwareupdate_notify_agent                   |          |              |
|   435 | ??      |   0:16.81 | imklaunchagent                                |          |              |
|   436 | ??      |   0:01.05 | com.apple.PhotoIngestService                  |          |              |
|   437 | ??      |   0:47.71 | PAH_Extension                                 |          |              |
|   450 | ??      |   0:01.25 | com.apple.photos.ImageConversionService       |          |              |
|   451 | ??      |   0:00.77 | coreauthd                                     |          |              |
|   453 | ??      |   0:05.55 | ContainerMetadataExtractor                    |          |              |
|   454 | ??      |   0:09.32 | com.apple.geod                                |          |              |
|   455 | ??      |   0:01.89 | secinitd                                      |          |              |
|   456 | ??      |   0:00.48 | colorsync.useragent                           |          |              |
|   457 | ??      |   0:00.49 | nfcd                                          |          |              |
|   458 | ??      |   0:01.26 | cfprefsd                                      |          |              |
|   466 | ??      |   0:00.32 | com.apple.cmio.registerassistantservice       |          |              |
|   467 | ??      |   0:06.43 | akd                                           |          |              |
|   469 | ??      |   0:02.82 | trustd                                        |          |              |
|   470 | ??      |   0:07.48 | AppleCameraAssistant                          |          |              |
|   477 | ??      |   0:01.15 | smd                                           |          |              |
|   478 | ??      |   0:04.03 | com.apple.photomodel                          |          |              |
|   479 | ??      |   0:24.78 | trustd                                        |          |              |
|   480 | ??      |   0:05.88 | com.apple.WeatherKitService                   |          |              |
|   481 | ??      |   2:07.43 | LocationMenu                                  |          |              |
|   483 | ??      |   0:00.07 | MTLCompilerService                            |          |              |
|   493 | ??      |   0:00.83 | distnoted                                     |          |              |
|   494 | ??      |   0:12.87 | adprivacyd                                    |          |              |
|   501 | ??      |   5:15.47 | suggestd                                      |          |              |
|   502 | ??      |   1:02.61 | knowledge-agent                               |          |              |
|   544 | ??      |   0:33.66 | atsd                                          |          |              |
|   632 | ??      | 387:38.36 | Dock                                          |          |              |
|   633 | ??      |   5:51.60 | SystemUIServer                                |          |              |
|   634 | ??      | 106:15.77 | Finder                                        |          |              |
|   648 | ??      |   0:39.59 | ACCFinderSync                                 |          |              |
|   652 | ??      |   1:52.53 | Spotlight                                     |          |              |
|   653 | ??      |   0:00.34 | MTLCompilerService                            |          |              |
|   654 | ??      |   2:04.48 | parsecd                                       |          |              |
|   659 | ??      |   0:02.72 | taskgated                                     |          |              |
|   660 | ??      |   0:02.47 | mdwrite                                       |          |              |
|   661 | ??      |   0:02.35 | videosubscriptionsd                           |          |              |
|   663 | ??      |   1:01.54 | WiFiProxy                                     |          |              |
|   668 | ??      |   0:00.10 | MTLCompilerService                            |          |              |
|   680 | ??      |   0:38.80 | com.apple.dock.extra                          |          |              |
|   690 | ??      |   0:01.03 | AudioComponentRegistrar                       |          |              |
|   696 | ??      |   0:00.02 | SafeEjectGPUAgent                             |          |              |
|   697 | ??      |   0:00.52 | SafeEjectGPUService                           |          |              |
|   710 | ??      |   0:00.50 | MTLCompilerService                            |          |              |
|   711 | ??      |   0:07.82 | CallHistoryPluginHelper                       |          |              |
|   713 | ??      |   0:00.36 | corespeechd                                   |          |              |
|   717 | ??      |   0:00.98 | SocialPushAgent                               |          |              |
|   720 | ??      |   0:01.47 | dmd                                           |          |              |
|   721 | ??      |   0:14.77 | icdd                                          |          |              |
|   724 | ??      |   0:03.32 | AGMService                                    |          |              |
|   725 | ??      |   0:38.23 | AirPlayUIAgent                                |          |              |
|   726 | ??      |   0:59.20 | cloudpaird                                    |          |              |
|   727 | ??      |   0:46.80 | org.w0lf.mySIMBLAgent                         |          |              |
|   730 | ??      |   0:47.80 | nbagent                                       |          |              |
|   732 | ??      |   0:03.86 | Amazon                                        | Music    | Helper       |
|   733 | ??      |   0:00.36 | ctkahp                                        |          |              |
|   734 | ??      |   4:16.70 | Alfred                                        | 3        |              |
|   735 | ??      |   0:00.51 | ctkahp                                        |          |              |
|   736 | ??      |   0:00.34 | ctkd                                          |          |              |
|   737 | ??      |   5:22.95 | aText                                         |          |              |
|   741 | ??      |  36:55.96 | CheatSheet                                    |          |              |
|   745 | ??      |   3:28.17 | Lacaille                                      |          |              |
|   746 | ??      |   1:01.23 | TISwitcher                                    |          |              |
|   750 | ??      |   0:00.10 | MTLCompilerService                            |          |              |
|   754 | ??      |   0:00.10 | MTLCompilerService                            |          |              |
|   757 | ??      |   0:18.18 | ReportCrash                                   |          |              |
|   778 | ??      |   0:00.02 | installerdiagd                                |          |              |
|   800 | ??      |   0:00.53 | storelegacy                                   |          |              |
|   802 | ??      |   1:58.85 | AdobeIPCBroker                                |          |              |
|   823 | ??      |   5:30.21 | Adobe                                         | Desktop  | Service      |
|   835 | ??      |   6:03.77 | AdobeCRDaemon                                 |          |              |
|   836 | ??      |   0:02.04 | com.adobe.acc.installer                       |          |              |
|   842 | ??      |   1:26.31 | Core                                          | Sync     |              |
|   844 | ??      |   0:32.90 | node                                          |          |              |
|   845 | ??      |   7:39.99 | AdobeCRDaemon                                 |          |              |
|   878 | ??      |   0:00.37 | cacheAssistant                                |          |              |
|   879 | ??      |   0:36.15 | SoftwareUpdateNotificationManager             |          |              |
|   882 | ??      |   0:34.18 | LaterAgent                                    |          |              |
|   900 | ??      |   0:00.10 | MTLCompilerService                            |          |              |
|   901 | ??      |   0:00.80 | findmydevice-user-agent                       |          |              |
|   909 | ??      |   0:41.66 | storeassetd                                   |          |              |
|   912 | ??      |   0:01.01 | dmd                                           |          |              |
|   914 | ??      |   0:16.69 | fileproviderd                                 |          |              |
|   928 | ??      |   0:40.03 | appstoreagent                                 |          |              |
|   933 | ??      |   0:02.32 | dprivacyd                                     |          |              |
|   934 | ??      |   0:00.63 | UsageTrackingAgent                            |          |              |
|   936 | ??      |   0:06.86 | mdworker                                      |          |              |
|   937 | ??      |   2:05.61 | mdworker                                      |          |              |
|  1084 | ??      |   1:48.34 | SafariCloudHistoryPushAgent                   |          |              |
|  1112 | ??      |   0:01.79 | reversetemplated                              |          |              |
|  1118 | ??      |   0:00.36 | storeinstalld                                 |          |              |
|  1119 | ??      |   0:00.54 | com.apple.CommerceKit.TransactionService      |          |              |
|  1143 | ??      |   0:00.58 | USBAgent                                      |          |              |
|  1236 | ??      |   0:10.04 | CallHistorySyncHelper                         |          |              |
|  1239 | ??      |   0:00.96 | SidecarRelay                                  |          |              |
|  1277 | ??      |   0:07.71 | recentsd                                      |          |              |
|  1278 | ??      |   0:05.14 | mapspushd                                     |          |              |
|  1284 | ??      |   1:12.57 | QuickLookUIService                            |          |              |
|  1285 | ??      |   0:00.02 | com.apple.audio.SandboxHelper                 |          |              |
|  1286 | ??      |   0:00.48 | com.apple.accessibility.mediaaccessibilityd   |          |              |
|  1305 | ??      |  28:28.26 | com.apple.Safari.History                      |          |              |
|  1308 | ??      |   0:19.77 | com.apple.hiservices-xpcservice               |          |              |
|  1318 | ??      |   0:35.70 | com.apple.CoreSimulator.CoreSimulatorService  |          |              |
|  1323 | ??      |   1:17.73 | AppleSpell                                    |          |              |
|  1324 | ??      |   0:09.65 | keyboardservicesd                             |          |              |
|  1328 | ??      |   1:22.95 | com.apple.Safari.SafeBrowsing.Service         |          |              |
|  1331 | ??      |   4:47.72 | GoogleJapaneseInput                           |          |              |
|  1332 | ??      |   7:12.83 | GoogleJapaneseInputRenderer                   |          |              |
|  1333 | ??      |   2:28.17 | GoogleJapaneseInputConverter                  |          |              |
|  1346 | ??      |   0:09.53 | ContextService                                |          |              |
|  1348 | ??      |   0:00.10 | MTLCompilerService                            |          |              |
|  1359 | ??      |   0:00.06 | periodic-wrapper                              |          |              |
|  1422 | ??      |   0:02.70 | silhouette                                    |          |              |
|  1428 | ??      |   0:06.17 | media-indexer                                 |          |              |
|  1429 | ??      |   0:01.74 | com.apple.iTunesLibraryService                |          |              |
|  1433 | ??      |   0:00.01 | periodic-wrapper                              |          |              |
|  1461 | ??      |   0:00.05 | DataDetectorsSourceAccess                     |          |              |
|  1471 | ??      |   0:01.63 | IMAutomaticHistoryDeletionAgent               |          |              |
|  1483 | ??      |   0:00.21 | mobileactivationd                             |          |              |
|  1623 | ??      |   0:01.75 | assertiond                                    |          |              |
|  1748 | ??      |   0:00.10 | ssh-agent                                     |          |              |
| 18299 | ??      |   0:00.27 | fpsd                                          |          |              |
| 18300 | ??      |   0:01.31 | com.apple.BKAgentService                      |          |              |
| 18396 | ??      |   0:00.68 | printtool                                     |          |              |
| 18424 | ??      |   0:07.99 | VTDecoderXPCService                           |          |              |
| 18497 | ??      |   0:30.51 | OSDUIHelper                                   |          |              |
| 18498 | ??      |   0:00.08 | MTLCompilerService                            |          |              |
| 18971 | ??      |   1:19.24 | CoreServicesUIAgent                           |          |              |
| 20256 | ??      |   0:00.38 | DiskUnmountWatcher                            |          |              |
| 20416 | ??      |   0:07.81 | contactsdonationagent                         |          |              |
| 20420 | ??      |   0:01.67 | heard                                         |          |              |
| 20422 | ??      |   0:00.66 | personad                                      |          |              |
| 20433 | ??      |   0:00.33 | com.apple.tonelibraryd                        |          |              |
| 20435 | ??      |   0:17.48 | ContactsAgent                                 |          |              |
| 20480 | ??      |   0:01.06 | PrintUITool                                   |          |              |
| 20507 | ??      |   0:00.39 | hdiejectd                                     |          |              |
| 20509 | ??      |   0:04.75 | diskimages-helper                             |          |              |
| 20545 | ??      |   0:00.42 | SafariPlugInUpdateNotifier                    |          |              |
| 20672 | ??      |   0:35.48 | storeuid                                      |          |              |
| 21129 | ??      |   0:04.15 | com.apple.WebKit.Networking                   |          |              |
| 21160 | ??      |   0:04.21 | com.apple.WebKit.Networking                   |          |              |
| 21186 | ??      |   0:09.53 | normalizerd                                   |          |              |
| 21296 | ??      |   0:14.91 | com.apple.WebKit.Networking                   |          |              |
| 21306 | ??      |   0:00.10 | MTLCompilerService                            |          |              |
| 21335 | ??      |   0:00.98 | MTLCompilerService                            |          |              |
| 21336 | ??      |   0:00.31 | MTLCompilerService                            |          |              |
| 21506 | ??      |   0:14.77 | com.apple.WebKit.Networking                   |          |              |
| 21674 | ??      |   0:04.16 | com.apple.WebKit.Networking                   |          |              |
| 21765 | ??      |   0:00.30 | GSSCred                                       |          |              |
| 21785 | ??      |   0:05.79 | XprotectService                               |          |              |
| 21805 | ??      |   0:14.23 | com.apple.WebKit.Networking                   |          |              |
| 22171 | ??      |   0:04.08 | com.apple.WebKit.Networking                   |          |              |
| 22186 | ??      |   0:00.64 | distnoted                                     |          |              |
| 22322 | ??      |   0:04.16 | com.apple.WebKit.Networking                   |          |              |
| 22475 | ??      |   0:04.07 | com.apple.WebKit.Networking                   |          |              |
| 22774 | ??      |   0:00.40 | com.apple.SafariServices                      |          |              |
| 22797 | ??      |   0:03.98 | com.apple.WebKit.Networking                   |          |              |
| 22897 | ??      |   0:13.68 | navd                                          |          |              |
| 22966 | ??      |   0:04.29 | com.apple.WebKit.Networking                   |          |              |
| 22981 | ??      |   0:04.07 | com.apple.WebKit.Networking                   |          |              |
| 23164 | ??      |   0:13.58 | com.apple.WebKit.Networking                   |          |              |
| 23380 | ??      |   0:00.01 | aslmanager                                    |          |              |
| 24962 | ??      |   0:25.36 | iTunesHelper                                  |          |              |
| 24963 | ??      |   0:39.38 | MobileDeviceUpdater                           |          |              |
| 24970 | ??      |   0:36.80 | EvernoteHelper                                |          |              |
| 25007 | ??      |   0:00.26 | loginitemregisterd                            |          |              |
| 25038 | ??      |   0:05.11 | diskimages-helper                             |          |              |
| 26098 | ??      |   0:00.02 | applessdstatistics                            |          |              |
| 27155 | ??      |   0:00.61 | com.apple.speech.speechsynthesisd             |          |              |
| 27156 | ??      |   0:00.01 | com.apple.audio.SandboxHelper                 |          |              |
| 27210 | ??      |   0:00.01 | periodic-wrapper                              |          |              |
| 27262 | ??      |   0:00.09 | MTLCompilerService                            |          |              |
| 27318 | ??      |   0:30.10 | PerfPowerServices                             |          |              |
| 27321 | ??      |   8:24.96 | iTerm2                                        |          |              |
| 27651 | ??      |   0:00.44 | MTLCompilerService                            |          |              |
| 27895 | ??      |   0:00.02 | com.apple.audio.SandboxHelper                 |          |              |
| 28488 | ??      |   0:04.36 | diskimages-helper                             |          |              |
| 28654 | ??      |   0:07.20 | syspolicyd                                    |          |              |
| 29226 | ??      |   0:11.92 | com.apple.WebKit.Networking                   |          |              |
| 29283 | ??      |   0:11.08 | com.apple.WebKit.Networking                   |          |              |
| 29324 | ??      |   0:11.30 | com.apple.WebKit.Networking                   |          |              |
| 29822 | ??      |   0:10.30 | sandboxd                                      |          |              |
| 29854 | ??      |  21:26.99 | Emacs-x86_64-10_9                             |          |              |
| 29940 | ??      |   0:00.12 | cmigemo                                       |          |              |
| 29963 | ??      |   0:00.44 | aspell                                        |          |              |
| 30257 | ??      |   0:10.99 | com.apple.WebKit.Networking                   |          |              |
| 30792 | ??      |   0:38.10 | Safari                                        |          |              |
| 30796 | ??      |   0:07.22 | com.apple.WebKit.Networking                   |          |              |
| 30797 | ??      |   0:04.41 | com.apple.Safari.SandboxBroker                |          |              |
| 30798 | ??      |   0:00.11 | webinspectord                                 |          |              |
| 30800 | ??      |   0:02.01 | com.apple.WebKit.Storage                      |          |              |
| 30806 | ??      |   0:01.03 | com.apple.Safari.SearchHelper                 |          |              |
| 30815 | ??      |   0:29.09 | com.apple.WebKit.WebContent                   |          |              |
| 31079 | ??      |   0:00.27 | mdworker_shared                               |          |              |
| 31166 | ??      |   0:21.59 | Calendar                                      |          |              |
| 31214 | ??      |   2:02.86 | Microsoft                                     | Excel    |              |
| 31250 | ??      |   0:02.00 | com.apple.WebKit.Networking                   |          |              |
| 32595 | ??      |   0:00.04 | docker-machine                                |          |              |
| 32596 | ??      |   0:00.00 | (docker-machine)                              |          |              |
| 32605 | ??      |   0:00.00 | (ssh)                                         |          |              |
| 33059 | ??      |   0:07.28 | netbiosd                                      |          |              |
| 33199 | ??      |   0:04.75 | com.apple.WeatherKitService                   |          |              |
| 33455 | ??      |   0:10.42 | com.apple.WebKit.Networking                   |          |              |
| 33527 | ??      |   0:00.46 | mdworker_shared                               |          |              |
| 33564 | ??      |   0:00.05 | AssetCacheManagerService                      |          |              |
| 33569 | ??      |   0:32.95 | Problem                                       | Reporter |              |
| 33570 | ??      |   0:00.23 | MTLCompilerService                            |          |              |
| 33908 | ??      |   0:13.77 | diskimages-helper                             |          |              |
| 33991 | ??      |   0:00.17 | MTLCompilerService                            |          |              |
| 34006 | ??      |   0:00.02 | com.docker.vmnetd                             |          |              |
| 34801 | ??      |   0:00.34 | mdworker_shared                               |          |              |
| 34817 | ??      |   0:00.12 | mdworker_shared                               |          |              |
| 35144 | ??      |   0:00.14 | ocspd                                         |          |              |
| 35147 | ??      |   0:04.34 | BetterTouchTool                               |          |              |
| 35149 | ??      |   0:00.26 | mdworker_shared                               |          |              |
| 35151 | ??      |   0:00.02 | BetterTouchToolScriptRunner                   |          |              |
| 35152 | ??      |   0:00.02 | BetterTouchToolShellScriptRunner              |          |              |
| 35154 | ??      |   0:00.22 | BTTRelaunch                                   |          |              |
| 35157 | ??      |   0:00.07 | mdworker_shared                               |          |              |
| 35170 | ??      |   0:00.53 | Office365ServiceV2                            |          |              |
| 35172 | ??      |   0:00.13 | mdworker_shared                               |          |              |
| 35179 | ??      |   0:12.46 | Microsoft                                     | Word     |              |
| 35180 | ??      |   0:00.03 | taskgated-helper                              |          |              |
| 35183 | ??      |   0:00.09 | mdworker_shared                               |          |              |
| 35189 | ??      |   0:05.11 | com.apple.appkit.xpc.openAndSavePanelService  |          |              |
| 35190 | ??      |   0:00.03 | automountd                                    |          |              |
| 35192 | ??      |   0:00.22 | ACCFinderSync                                 |          |              |
| 35193 | ??      |   0:00.30 | garcon                                        |          |              |
| 35194 | ??      |   0:00.10 | quicklookd                                    |          |              |
| 35197 | ??      |   0:00.12 | com.apple.security.pboxd                      |          |              |
| 35214 | ??      |   0:00.01 | sh                                            |          |              |
| 35215 | ??      |   0:00.00 | ps                                            |          |              |
| 37822 | ??      |   0:02.40 | diskmanagementd                               |          |              |
| 37838 | ??      |   0:03.90 | DiskSpaceEfficiency                           |          |              |
| 37842 | ??      |   0:03.38 | systemmigrationd                              |          |              |
| 37843 | ??      |   2:03.77 | storagekitd                                   |          |              |
| 41342 | ??      |   0:01.02 | com.apple.speech.speechsynthesisd             |          |              |
| 46486 | ??      |   0:00.11 | MTLCompilerService                            |          |              |
| 47122 | ??      |   0:00.68 | siriknowledged                                |          |              |
| 51351 | ??      |  16:00.89 | Backup                                        | and      | Sync         |
| 58481 | ??      |  17:40.48 | Dropbox                                       |          |              |
| 58483 | ??      |   0:00.14 | Dropbox                                       |          |              |
| 58484 | ??      |   0:00.02 | Dropbox                                       |          |              |
| 58495 | ??      |   0:11.61 | Dropbox                                       | Web      | Helper       |
| 58496 | ??      |   0:23.18 | Dropbox                                       | Web      | Helper       |
| 58497 | ??      |   0:00.21 | VTDecoderXPCService                           |          |              |
| 58515 | ??      |   0:00.36 | DropboxFolderTagger                           |          |              |
| 58530 | ??      |   0:19.03 | garcon                                        |          |              |
| 58552 | ??      |   0:19.81 | garcon                                        |          |              |
| 58903 | ??      |   0:00.12 | com.apple.CharacterPicker.FileService         |          |              |
| 58944 | ??      |   0:08.85 | dbfseventsd                                   |          |              |
| 58945 | ??      |   0:46.89 | dbfseventsd                                   |          |              |
| 58946 | ??      |   0:49.11 | dbfseventsd                                   |          |              |
| 59793 | ??      |   0:00.21 | MTLCompilerService                            |          |              |
| 66106 | ??      |   0:15.93 | garcon                                        |          |              |
| 67600 | ??      |   0:05.70 | com.apple.WebKit.Networking                   |          |              |
| 77851 | ??      |   0:17.71 | Docker                                        |          |              |
| 77870 | ??      |   0:05.95 | com.docker.supervisor                         |          |              |
| 77871 | ??      |   0:00.18 | com.docker.osxfs                              |          |              |
| 77872 | ??      |   1:31.15 | com.docker.vpnkit                             |          |              |
| 77873 | ??      |   0:07.19 | com.docker.driver.amd64-linux                 |          |              |
| 77874 | ??      |   0:00.00 | (uname)                                       |          |              |
| 77877 | ??      |  86:36.45 | com.docker.hyperkit                           |          |              |
| 78287 | ??      |   0:11.92 | garcon                                        |          |              |
| 78399 | ??      |   0:00.04 | DropboxNotificationService                    |          |              |
| 30974 | ttys000 |   0:00.04 | iTerm2                                        |          |              |
| 30975 | ttys000 |   0:00.03 | login                                         |          |              |
| 30976 | ttys000 |   0:00.85 | -fish                                         |          |              |

たとえば，固まったWordを強制終了させるとき
#+BEGIN_SRC sh
open test.docx
#+END_SRC

#+RESULTS:
"Word"という名前を含むプロセスを検索
#+BEGIN_SRC sh
ps -ax | grep Word
#+END_SRC

#+RESULTS:
| 35179 | ?? | 0:16.27 | /Applications/Microsoft | Word.app/Contents/MacOS/Microsoft | Word |
| 35237 | ?? | 0:00.00 | grep                    | Word                              |      |

PIDがわかったら，それをkill 35179のように指定して強制終了させる
*** 名前の一括変更とファイルの一覧表示
#+BEGIN_SRC sh
ls dir
cp *est* dir
ls dir
#+END_SRC

#+RESULTS:
| test.docx   |
| ~$test.docx |

#+BEGIN_SRC sh
rm dir/*est*
ls dir
#+END_SRC

#+RESULTS:

*** 表示されないファイルの探索
#+BEGIN_SRC sh
ls -a
#+END_SRC

#+RESULTS:
| #Unix_for_OSX.org# |
| 0                  |
| .#Unix_for_OSX.org |
| ..                 |
| .DS_Store          |
| Unix_for_OSX.org   |
| Unix_for_OSX.org~  |
| dir                |
| test.docx          |
| ~$test.docx        |

** フォルダか，ディレクトリか？
同じもの．
** 無数に存在する無料のアプリケーション
OSXはDarwinというオープンソースのUnixOSを基に作られている．
- GIMP
- NeoOffice
など
*** インターネット接続の威力
自分のMacにはftpが入っていない？
#+BEGIN_SRC sh
ftp ftp.oreilly.com
#+END_SRC

#+RESULTS:

** Unixに含まれるコマンド
軽く1000を超える．
*** Unixコマンドを全て表示する
自分の環境では再現できなかった．
*** よく使うUnixコマンド
- grep: 複数のファイルの内容から，指定した「パターン」に当てはまるものを探し出す．メール検索などに使える．
- top: OSX内で実行されているアプリケーションやコマンドを表示する．
** 簡単なUnix入門
引数をつけないcdは$HOMEへ移動する．
#+BEGIN_SRC sh
cd
pwd
ls
#+END_SRC

#+RESULTS:
| /Users/ahayashi     |         |       |
| #test#              |         |       |
| #test.org#          |         |       |
| Applications        |         |       |
| Calibre             | Library |       |
| Creative            | Cloud   | Files |
| Databases           |         |       |
| Desktop             |         |       |
| Documents           |         |       |
| Downloads           |         |       |
| Dropbox             |         |       |
| Google              | Drive   |       |
| LSD                 |         |       |
| Library             |         |       |
| Mail                |         |       |
| Movies              |         |       |
| Music               |         |       |
| News                |         |       |
| Pictures            |         |       |
| Pixa.pxlibrary      |         |       |
| Public              |         |       |
| convertExcelToCsv.R |         |       |
| fonts               |         |       |
| gmail               |         |       |
| intel               |         |       |
| junk                |         |       |
| mylibrary.bib       |         |       |
| mylibrary.bib~      |         |       |
| mylibrary2.bib~     |         |       |
| org-demo            |         |       |
| shakespack-allidx   |         |       |
| ssh-host-color      |         |       |
| test.org            |         |       |
| texput.log          |         |       |
| tmp                 |         |       |
#+BEGIN_SRC sh
cd
cd Library
ls
#+END_SRC

#+RESULTS:
| Accounts                  |             |       |
| Application               | Scripts     |       |
| Application               | Support     |       |
| Assistant                 |             |       |
| Assistants                |             |       |
| Audio                     |             |       |
| Autosave                  | Information |       |
| Caches                    |             |       |
| Calendars                 |             |       |
| CallServices              |             |       |
| ColorPickers              |             |       |
| ColorSync                 |             |       |
| Colors                    |             |       |
| Compositions              |             |       |
| Containers                |             |       |
| Cookies                   |             |       |
| CoreData                  |             |       |
| CoreFollowUp              |             |       |
| DES                       |             |       |
| Developer                 |             |       |
| Dictionaries              |             |       |
| Dropbox                   |             |       |
| Family                    |             |       |
| Favorites                 |             |       |
| FileProvider              |             |       |
| FontCollections           |             |       |
| Fonts                     |             |       |
| Frameworks                |             |       |
| FrontBoard                |             |       |
| GameKit                   |             |       |
| Google                    |             |       |
| Group                     | Containers  |       |
| Haskell                   |             |       |
| HomeKit                   |             |       |
| Icons                     |             |       |
| IdentityServices          |             |       |
| Input                     | Methods     |       |
| Internet                  | Plug-Ins    |       |
| Jupyter                   |             |       |
| Keyboard                  |             |       |
| Keyboard                  | Layouts     |       |
| KeyboardServices          |             |       |
| Keychains                 |             |       |
| LanguageModeling          |             |       |
| LaunchAgents              |             |       |
| Logs                      |             |       |
| Mail                      |             |       |
| Maps                      |             |       |
| Messages                  |             |       |
| Metadata                  |             |       |
| Mobile                    | Documents   |       |
| News                      |             |       |
| PDF                       | Services    |       |
| Passes                    |             |       |
| PersonalizationPortrait   |             |       |
| Personas                  |             |       |
| PhotoshopCrashes          |             |       |
| PreferencePanes           |             |       |
| Preferences               |             |       |
| Printers                  |             |       |
| Processing                |             |       |
| PubSub                    |             |       |
| QuickLook                 |             |       |
| Safari                    |             |       |
| SafariSafeBrowsing        |             |       |
| Saved                     | Application | State |
| Saved                     | Searches    |       |
| Screen                    | Savers      |       |
| Scripts                   |             |       |
| Services                  |             |       |
| Sharing                   |             |       |
| Sounds                    |             |       |
| Spelling                  |             |       |
| Suggestions               |             |       |
| SyncedPreferences         |             |       |
| TeXShop                   |             |       |
| TeXworks                  |             |       |
| TextWrangler              |             |       |
| VirtualBox                |             |       |
| Voices                    |             |       |
| WebKit                    |             |       |
| XMind                     |             |       |
| com.amplitude.archiveDict |             |       |
| com.amplitude.plist       |             |       |
| com.apple.internal.ck     |             |       |
| iMovie                    |             |       |
| iTunes                    |             |       |
| texlive                   |             |       |

* ターミナルを使う

** Unixコマンド行の構文
コマンド いくつかのオプション いくつかのファイル名
が基本．
** コマンドの入力
*** 使用中のアカウント
#+BEGIN_SRC sh
who am i
#+END_SRC

#+RESULTS:
: ahayashi tty??    Dec  8 17:48

*** 日付
#+BEGIN_SRC sh
date
#+END_SRC

#+RESULTS:
: Sat Dec  8 17:50:37 JST 2018

*** ユーザに関する情報
#+BEGIN_SRC sh
who -u
#+END_SRC

#+RESULTS:
| ahayashi console  Nov 12 08:17  old  |   114 |
| ahayashi ttys000  Dec  7 10:05 00:15 | 30975 |

#+BEGIN_SRC sh
finger
#+END_SRC

#+RESULTS:
| Login    | Name  | TTY     | Idle | Login | Time | Office | Phone |
| ahayashi | Akira | Hayashi | *con |   26d | Nov  |     12 | 08:17 |
| ahayashi | Akira | Hayashi | s00  |    14 | Fri  |  10:05 |       |

#+BEGIN_SRC sh
w
#+END_SRC

#+RESULTS:
| 17:51    | up      |   26 | days,   | 9:35,  |     2 | users, | load | averages: | 2.16 | 2.49 | 2.14 |
| USER     | TTY     | FROM | LOGIN@  | IDLE   |  WHAT |        |      |           |      |      |      |
| ahayashi | console |    0 | 12Nov18 | 26days |     0 |        |      |           |      |      |      |
| ahayashi | s000    |    0 | Fri10   | 15     | -fish |        |      |           |      |      |      |


** ターミナルの環境設定を変更

*** 起動
シェルの選択
*** 設定
** 「ターミナル」アプリケーションが持つ機能
*** キーボード入力を保護する
*** さらに役立つ仕組み
**** 使い捨ての単一コマンド
command-shift-N
**** テキストをエスケープしてペースト
command-control-V
**** 選択部分をペースト
command-shift-V
** 「ターミナル」アプリケーションの作業環境の変更
*** ウインドウタイトルの設定
ANSIエスケープ: Ctrl-Vのあとに特殊コマンド
*** AppleScriptの使用
osascript -eで設定
*** .terminalファイルの使用
ウインドウの状態を保存できる．ダブルクリックでまたその状態で開ける．
** ターミナル内での作業
#+BEGIN_SRC sh
echo $SHELL
#+END_SRC

#+RESULTS:
: /usr/local/bin/fish
*** シェルプロンプト
プロンプトが#記号で終わっている場合，スーパーユーザーでログインしている．
使い方を誤ると，システムを壊す危険性があるので，自分用のアカウントでログインし直したほうがいい．
*** コマンドの入力
**** dateコマンド
**** whoコマンド
*** コマンドの再利用
*** ファイル名やディレクトリ名の補完機能
TAB
*** コマンド行で一気に複数のコマンドを実行
;で区切る
以下は実行に時間がかかるので注意！
#+BEGIN_SRC sh
cd ~ ; date ; du -s . ; date
#+END_SRC

#+RESULTS:
| Sat       | Dec | 8 | 18:12:36 | JST | 2018 |
| 435822808 | 0   |   |          |     |      |
| Sat       | Dec | 8 | 18:14:11 | JST | 2018 |
容量を計算するのに1分40秒ほどかかっている．
*** コマンドの修正
*** 作業の終了
exit
*** 問題判別確認表
** シェル環境の変更
*** シェルの選択
*** コマンドプロンプトの変更
** さらなる設定変更
*** シェルプロンプトの設定変更
*** エイリアスの作成
** 応答しないターミナル
* ファイルシステム探訪
* ファイル管理
* ファイル検索と情報取得
* 入出力のリダイレクト機能
* マルチタスク
* Unixのネットワーク環境
* ウインドウシステムとX11
* 今後
